# # Task 19
# list_1 = [45, 23, 1, 5, 31] # len()
# k = int(input("Введите кол-во сдвигов: ")) % len(list_1)
# # print(list_1[begin=0:end=обязательный_парамет:step=+1])
# if k == 0:
#     print(list_1)
# else:
#     print(list_1[-k:] + list_1[:len(list_1) - k])

# Требуется вычислить, сколько раз встречается некоторое число k в массиве list_1.
#
# Найдите количество и выведите его.

# list_1 = [1, 2, 3, 4, 5]
# k = int(input("Введите к - "))
# counter = 0
# for i in range(len(list_1)):
#     if list_1[i] == k:
#         counter += 1
# print(counter)

# Требуется найти в массиве list_1 самый близкий по величине элемент к заданному числу k и вывести его.
# near = list_1[0]
# t = k
# for i in range(1, len(list_1)):
#     if list_1[i] == k:
#         near = k
#         t = 0
#     else:
#         d = k - list_1[i]
#         if d < 0:
#             d *= -1
#         if d < t:
#             t = d
#             near = list_1[i]
# print(near)

# Напишите программу, которая вычисляет стоимость введенного пользователем слова k и выводит его.
# Будем считать, что на вход подается только одно слово, которое содержит либо только английские,
# либо только русские буквы.
dict_1 = {"A": 1, "E": 1, "I": 1, "O": 1, "U": 1, "L": 1, "N": 1, "S": 1, "T": 1, "R": 1,
          "А": 1, "В": 1, "Е": 1, "И": 1, "Н": 1, "О": 1, "Р": 1, "С": 1, "Т": 1,
          "D": 2, "G": 2, "Д": 2, "К": 2, "Л": 2, "М": 2, "П": 2, "У": 2,
          "B": 3, "C": 3, "M": 3, "P": 3, "Б": 3, "Г": 3, "Ё": 3, "Ь": 3, "Я": 3,
          "F": 4, "H": 4, "V": 4, "W": 4, "Y": 4, "Й": 4, "Ы": 4,
          "K": 5, "Ж": 5, "З": 5, "Х": 5, "Ц": 5, "Ч": 5,
          "J": 8, "X": 8, "Ш": 8, "Э": 8, "Ю": 8,
          "Q": 10, "Z": 10, "Ф": 10, "Щ": 10, "Ъ": 10}
k = input("Введите слово - ")
res = 0
for i in range(len(k)):
    for key in dict_1:
        if k[i].upper() == key:
            res += dict_1[key]
print(res)
